lvx/base/Documents/бит_УстановкаАктивныхКомплектовДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УстановкаАктивныхКомплектовДвижений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_АктивныеКомплектыДвижений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомплектыДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_КомплектыДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/InformationRegisters/бит_АктивныеКомплектыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_АктивныеКомплектыДвижений</Name>
			<Comment>(МХО)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КомплектыДвижений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Documents/бит_УстановкаАктивныхКомплектовДвижений/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

// Хранит валюту регламентированного учета
Перем мВалютаРегламентированногоУчета Экспорт;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа.
// 
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("УстановкаКомплектов", "Установка активности комплектов");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция проверяет принадлежность к организации.
// 
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  СтрокаПринадлежность - Строка.
// 
Функция ПолучитьПринадлежностьОрганизациям() Экспорт
	Если не ЗначениеЗаполнено(Организация) Тогда
		Возврат "для всех организаций";
	КонецЕсли;
	Возврат Организация.Наименование;
КонецФункции

// Процедура проверяет правильность заполнения строк табличной части "Комплекты движений".
// 
// Параметры: 
//  Таблица 						- таблица значений, содержащая данные для проведения и проверки ТЧ "Комплекты движений"
//  СтруктураШапкиДокумента 		- выборка из результата запроса по шапке документа,
//  Отказ                   		- флаг отказа в проведении.
//  Заголовок               		- строка, заголовок сообщения об ошибке проведения.
// 
Процедура ПроверитьЗаполнениеТабличнойЧастиКомплектыДвижений(Таблица, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("ВидДокумента");
	СтруктураОбязательныхПолей.Вставить("Комплект");

	// Теперь вызовем общую процедуру проверки.
	бит_РаботаСМетаданными.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "КомплектыДвижений", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиКомплектыДвижений()

#КонецОбласти

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Процедура выполняет движения по регистрам.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  Отказ                   - Булево.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ) Экспорт
	
	// Запрос к таблицчной части
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.Ссылка.Организация,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.ВидДокумента,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.Комплект,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.ДатаНачала КАК Период,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.ДатаОкончания
	|ИЗ
	|	Документ.бит_УстановкаАктивныхКомплектовДвижений.КомплектыДвижений КАК бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений
	|ГДЕ
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.Ссылка = &СсылкаУстановка
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.Ссылка.Организация,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.ВидДокумента,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.Комплект,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.ДатаНачала,
	|	бит_УстановкаАктивныхКомплектовДвиженийКомплектыДвижений.ДатаОкончания");
	
	Запрос.УстановитьПараметр("СсылкаУстановка", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Движения.бит_АктивныеКомплектыДвижений.Загрузить(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверитьЗаполнениеТабличнойЧастиКомплектыДвижений(КомплектыДвижений, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если КомплектыДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ);
	КонецЕсли;
               
КонецПроцедуры // ОбработкаПроведения()

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
